import React from 'react';
import LessonStore from '../../LessonStore';

export default class Exercise6 extends React.Component {
  componentDidMount() {
    LessonStore.setLesson('exercise-6');
  }

  render() {
    return (
      <section id="exercise-description">
        <div id="introduction">
          <p>
            {' '}
            <span className="glyphicon glyphicon-star"></span> Αυτή η εργασία αφορά βελτίωση της 5ης
            εργασίας. Σε περίπτωση που δεν έχετε ολοκληρώσει την 5η εργασία, σας προτείνουμε να
            τελειώσετε πρώτα τις απαιτήσεις της 5ης εργασίας πριν προχωρήσετε.{' '}
          </p>
        </div>
        <div id="curriculum">
          <p>
            {' '}
            <span className="glyphicon glyphicon-education"></span> Ύλη: Ότι διδάχθηκε μέχρι αυτή
            την εργασία.{' '}
          </p>
        </div>
        <div id="problem">
          <h3>Εκφώνηση</h3>
          <p>
            Ζητείται να προσθέσετε την δυνατότητα "άμεσης προβολής" στο σύστημα του file uploader
            που έχετε κατασκευάσει. Αυτό σημαίνει ότι στην λίστα με τα αρχεία που μπορεί να
            κατεβάσει κανείς, θα πρέπει να μπορεί να κάνει κλικ σε κάποιο αρχείο για να προβάλλει τα
            περιεχόμενά του. Αυτή η προεπισκόπηση θα πρέπει να δουλεύει σε εικόνες και αρχεία
            κειμένου. Στη συνέχεια, αν επιθυμεί, θα πρέπει να δίνεται η δυνατότητα κανονικής λήψης
            του αρχείου. Η δυνατότητα αυτή θα πρέπει να δίνεται και στα αρχεία άλλων ειδών για τα
            οποία η προεπισκόπηση δεν είναι δυνατή.{' '}
          </p>
          <p>
            Πατώντας κανείς πάνω στο όνομα ενός αρχείου, θα πρέπει να βλέπει την προεπισκόπηση, που
            για κείμενα θα περιλαμβάνει το ίδιο το κείμενο, ενώ για εικόνες την ίδια την εικόνα,
            καθώς και ένα σύνδεσμο για πλήρη λήψη του αρχείου. Πατώντας ξανά, θα πρέπει να μπορεί να
            κρύβει την προεπισκόπηση. Στα αρχεία όπου η προεπισκόπηση δεν είναι εφικτή, θα πρέπει το
            ένα κλικ να οδηγεί σε κανονική λήψη του αρχείου.{' '}
          </p>
          <p>
            Απαιτείται το περιεχόμενο από τα αρχεία κειμένου των οποίων γίνεται η προεπισκόπηση να
            μην περιλαμβάνονται στην ίδια τη σελίδα, αλλά να κατεβαίνει με την χρήση AJAX. Αυτό
            σημαίνει ότι θα χρειαστείτε κάποια ένδειξη φόρτωσης (π.χ. "Γίνεται λήψη του αρχείου...")
            έως ότου εμφανίσετε το περιεχόμενο μέσα στην ίδια την σελίδα. Φροντίστε να μην γίνεται
            ξανά φόρτωση της σελίδας, αλλά το περιεχόμενο να εμφανίζεται χωρίς refresh.{' '}
          </p>
        </div>
        <div id="tip">
          <p>
            {' '}
            <span className="glyphicon glyphicon-exclamation-sign"></span> Μία λύση για τον χωρισμό
            των PHP αρχείων είναι να έχετε 2 PHP αρχεία: Το πρώτο που θα τυπώνει την λίστα με τα
            υπάρχοντα αρχεία και μία φόρμα, και το δεύτερο το οποίο θα είναι το action της φόρμας
            για το ανέβασμα του αρχείου και το οποίο απλώς θα αποθηκεύει το αρχείο και θα επιστρέφει
            τον χρήστη στην προηγούμενη σελίδα.{' '}
          </p>
        </div>
        <div id="solution">
          <p>
            {' '}
            <span className="glyphicon glyphicon-thumbs-up"></span> Ολοκληρώνοντας την εργασία σας
            μην διστάσετε να ρίξετε μια ματιά στις παρακάτω πρότυπες λύσεις:
          </p>
          <ul>
            <li>
              <a href="http://web-class.gr/resources/assignment6/solutions/kylelb.zip">
                {' '}
                Σωκράτης Βίδρος
              </a>
            </li>
          </ul>
        </div>
      </section>
    );
  }
}
