import React from 'react';
import LessonStore from '../../LessonStore';

export default class Exercise4 extends React.Component {
  componentDidMount() {
    LessonStore.setLesson('exercise-4');
  }

  render() {
    return (
      <section id="exercise-description">
        <div id="introduction">
          <p>
            {' '}
            <span className="glyphicon glyphicon-star"></span> Αυτή η εργασία αφορά μία πρακτική
            χρήση της PHP. Ο σκοπός της είναι να δείτε πώς η PHP χρησιμεύει για να δημιουργούμε
            σελίδες που είναι δυναμικές και έχουν περισσότερες δυνατότητες από μία στατική
            σελίδα.{' '}
          </p>
        </div>
        <div id="curriculum">
          <p>
            {' '}
            <span className="glyphicon glyphicon-education"></span> Ύλη: Ότι διδάχθηκε μέχρι αυτή
            την εργασία.{' '}
          </p>
        </div>
        <div id="problem">
          <h3>Εκφώνηση</h3>
          <p>
            Ζητείται να κατασκευάσετε μία απλή σελίδα για ανέβασμα αρχείων. Θα πρέπει να παρέχει τις
            ακόλουθες δυνατότητες:{' '}
          </p>
          <ul>
            <li>Ανέβασμα αρχείων</li>
            <li>Προβολή λίστας ανεβασμένων αρχείων</li>
            <li>Κατέβασμα ανεβασμένων αρχείων</li>
          </ul>
          <p>
            Επιμένουμε η ασκηση να παραμείνει <strong>απλή</strong>:{' '}
          </p>
          <ul>
            <li>Δεν χρειάζεται να υπάρχουν χρήστες.</li>
            <li>
              Τα αρχεία δεν χρειάζεται να αποθηκεύονται σε κάποια βάση δεδομένων. Απλώς στον φάκελο.
            </li>
            <li>Ο καθένας μπορεί να κατεβάσει τα αρχεία από οποιονδήποτε.</li>
            <li>
              Δεν χρειάζονται πολλές σελίδες. Μία σελίδα με μία λίστα από ανεβασμένα αρχεία και μία
              φόρμα είναι αρκετά.
            </li>
          </ul>
          <p>
            Επειδή ο browser δεν τρέχει PHP, αλλά αυτή τρέχει στον HTTP server, θα πρέπει να έχετε
            ένα μηχάνημα server όπου θα δοκιμάσετε τον κώδικά σας. Μπορείτε να κάνετε τον υπολογιστή
            σας server με εγκατάσταση του Apache και της PHP.{' '}
          </p>
          <p>
            <a href="http://web-class.gr/resources/apachephp/setup.html">
              Οδηγίες εγκατάστασης Apache και PHP
            </a>
          </p>
          <p>
            Είστε ελεύθεροι να σχεδιάσετε σε HTML/CSS την διεπαφή χρήστη που εσείς θέλετε. Μπορείτε
            να χρησιμοποιήσετε οτιδήποτε από HTML και CSS. Παρ' όλο που ο σκοπός της άσκησης δεν
            είναι η εξάσκηση σε HTML/CSS, τα αρχεία σας θα πρέπει να κάνουν validate.{' '}
          </p>
        </div>
        <div id="tip">
          <p>
            {' '}
            <span className="glyphicon glyphicon-exclamation-sign"></span> Μία λύση για τον χωρισμό
            των PHP αρχείων είναι να έχετε 2 PHP αρχεία: Το πρώτο που θα τυπώνει την λίστα με τα
            υπάρχοντα αρχεία και μία φόρμα, και το δεύτερο το οποίο θα είναι το action της φόρμας
            για το ανέβασμα του αρχείου και το οποίο απλώς θα αποθηκεύει το αρχείο και θα επιστρέφει
            τον χρήστη στην προηγούμενη σελίδα.{' '}
          </p>
        </div>
        <div id="solution">
          <p>
            {' '}
            <span className="glyphicon glyphicon-thumbs-up"></span> Ολοκληρώνοντας την εργασία σας
            μην διστάσετε να ρίξετε μια ματιά στις παρακάτω πρότυπες λύσεις:
          </p>
          <ul>
            <li>
              <a href="/exercise-6"> Δες την 6η εργασία</a>
            </li>
          </ul>
        </div>
      </section>
    );
  }
}
