import React from 'react';
import LessonStore from '../../LessonStore';

export default class Exercise7 extends React.Component {
  componentDidMount() {
    LessonStore.setLesson('exercise-7');
  }

  render() {
    return (
      <section id="exercise-description">
        <div id="introduction">
          <p>
            {' '}
            <span className="glyphicon glyphicon-star"></span> Η τελική εργασία θα απαιτεί την
            συνεργασία <strong>σε ομάδες των 3 ατόμων</strong> (ή περισσότερων αν το επιθυμείτε). Τα
            άτομα θα είναι της επιλογής σας. Θα πρέπει να αποφασίσετε την ομάδα με την οποία θα
            δουλέψετε μέσα στις επόμενες ημέρες. Μπορείτε αν θέλετε να συνεργαστείτε μέσω SVN ή git.
          </p>
        </div>
        <div id="curriculum">
          <p>
            {' '}
            <span className="glyphicon glyphicon-education"></span> Ύλη: Τα πάντα! Νιώστε
            ελεύθεροι/ες να εμβαθύνετε στις τεχνολογίες που έχουμε δείξει, ακολουθώντας τις αρχές
            που σας δείξαμε, αλλά χωρίς να περιορίζεστε στα πλαίσια του σεμιναρίου. Ανάλογα με τον
            τύπο της εφαρμογής σας, ενδέχεται να χρειαστεί να εμβαθύνετε σε κάποια διαφορετική
            τεχνολογία.
          </p>
        </div>
        <div id="problem">
          <h3>Εκφώνηση</h3>
          <p>
            Το θέμα της τελικής εργασίας θα είναι της επιλογής σας, ενώ ακολουθούν αρκετά
            προτεινόμενα θέματα. Η τελική εργασία αφορά την ανάπτυξη μίας μικρής αλλά πλήρους web
            εφαρμογής. Αν έχετε μία καλή ιδέα και την αναπτύξετε, θα θέλαμε να την εξελίξετε σε μία
            πραγματική ολοκληρωμένη και χρήσιμη υπηρεσία μετά το τέλος του σεμιναρίου. Ελπίζουμε 1 -
            2 ιδέες που θα αναπτυχθούν μέσα από το σεμινάριο να εξελιχθούν σε πραγματικές υπηρεσίες
            που θα είναι χρήσιμες για τον κόσμο, θα γίνουν γνωστές, και θα χρησιμοποιηθούν από ευρύ
            κοινό. Θα έχετε κάθε υποστήριξή μας γι' αυτό το σκοπό.
          </p>
          <h3>Προτεινόμενα Θέματα</h3>
          <ul>
            <li>
              <strong>Σελίδα τύπου Twitter:</strong> Κάθε χρήστης βλέπει μία λίστα με τα status
              updates που αναρτούν τα άτομα που "ακολουθεί".
            </li>
            <li>
              <strong>Forum:</strong> Χρήστες, topics, και αναρτήσεις σε κάθε topic.
            </li>
            <li>
              <strong>Ιστολόγιο:</strong> Κάθε χρήστης μπορεί να δημιουργήσει το δικό του blog, με
              αναρτήσεις και σχόλια σε κάθε ανάρτηση.
            </li>
            <li>
              <strong>Εικονολόγιο:</strong> Δυνατότητα σε κάθε χρήστη να ανεβάσει τις φωτογραφίες
              του και να τις μοιραστεί με τους φίλους του.
            </li>
            <li>
              <strong>Αγγελίες:</strong> Σελίδα αγγελιών όπου κάθε μέλος μπορεί να δει τις αγγελίες
              των άλλων και να αναρτήσει τις δικές του.
            </li>
            <li>
              <strong>Ερωτοαπαντήσεις:</strong> Σελίδα όπου μπορεί κανείς να αναρτήσει κάποια
              ερώτηση και να περιμένει απαντήσεις.
            </li>
            <li>
              <strong>Συλλογή αγαπημένων:</strong> Κάθε χρήστης έχει μία συλλογή από αγαπημένες
              ιστοσελίδες τις οποίες μπορεί να μοιραστεί με τους φίλους του.
            </li>
          </ul>
          <p>
            Θα προτιμούσαμε να σκεφτείτε εσείς ένα αυθεντικό θέμα και να το υλοποιήσετε, και να
            χρησιμοποιήσετε τα παραπάνω μόνο σαν πρωταρχικές ιδέες. Αν έχετε κάποια μεγάλη ιδέα,
            προσπαθήστε να υλοποιήσετε μία πλήρη και λειτουργική εφαρμογή που να κάνει κάποια
            πράγματα από αυτά που φαντάζεστε. Στη συνέχεια θα έχετε την ευκαιρία να την βελτιώσετε
            πέρα από τα πλαίσια του σεμιναρίου αν σας αρέσει.
          </p>
          <h3>Hosting</h3>
          <p>
            Αν θέλετε να αναπτύξετε μία πραγματική υπηρεσία θα χρειαστείτε ένα domain name και μία
            υπηρεσία hosting. Αυτά προσφέρονται από διάφορες εταιρίες, για παράδειγμα από το{' '}
            <a href="http://www.papaki.gr/" style={{ 'margin-right': 0 }}>
              papaki
            </a>{' '}
            σε τιμές κάτω από 5€ / μήνα. Έτσι θα μπορείτε να έχετε το δικό σας domain name (π.χ.
            example.com) και να έχουν πρόσβαση στην εφαρμογή σας όλοι. Θα χαρούμε να δούμε την
            εφαρμογή σας ολοκληρωμένη και διαθέσιμη online, και φυσικά να την χρησιμοποιήσουμε.
          </p>
        </div>
        <div id="tip">
          <p>
            {' '}
            <span className="glyphicon glyphicon-exclamation-sign"></span>{' '}
            <a href="/final"> Δες τις παρουσιάσεις των τελικών εργασιών.</a>
          </p>
        </div>
      </section>
    );
  }
}
